<!-- add-pr-comment:common_plan -->

# staging/common Terragrunt Plan:
```shell
Terraform will perform the following actions:
  # aws_cloudwatch_log_group.pinpoint_deliveries_failures_us_west_2[0] will be created
  + resource "aws_cloudwatch_log_group" "pinpoint_deliveries_failures_us_west_2" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = (sensitive value)
      + name_prefix       = (known after apply)
      + region            = "us-west-2"
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + tags_all          = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
    }
  # aws_cloudwatch_log_metric_filter.pinpoint-sms-blocked-as-spam-us-west-2[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "pinpoint-sms-blocked-as-spam-us-west-2" {
      + apply_on_transformed_logs = (known after apply)
      + id                        = (known after apply)
      + log_group_name            = (sensitive value)
      + name                      = "pinpoint-sms-blocked-as-spam-us-west-2"
      + pattern                   = "{ $.delivery.providerResponse = \"Blocked as spam by phone carrier\" }"
      + region                    = "us-west-2"
      + metric_transformation {
          + default_value = "0"
          + name          = "pinpoint-sms-blocked-as-spam-us-west-2"
          + namespace     = "LogMetrics"
          + unit          = "None"
          + value         = "1"
        }
    }
  # aws_cloudwatch_log_metric_filter.pinpoint-sms-phone-carrier-unavailable-us-west-2[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "pinpoint-sms-phone-carrier-unavailable-us-west-2" {
      + apply_on_transformed_logs = (known after apply)
      + id                        = (known after apply)
      + log_group_name            = (sensitive value)
      + name                      = "pinpoint-sms-phone-carrier-unavailable-us-west-2"
      + pattern                   = "{ $.delivery.providerResponse = \"Phone carrier is currently unreachable/unavailable\" }"
      + region                    = "us-west-2"
      + metric_transformation {
          + default_value = "0"
          + name          = "pinpoint-sms-phone-carrier-unavailable-us-west-2"
          + namespace     = "LogMetrics"
          + unit          = "None"
          + value         = "1"
        }
    }
  # aws_cloudwatch_log_metric_filter.pinpoint-sms-rate-exceeded-us-west-2[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "pinpoint-sms-rate-exceeded-us-west-2" {
      + apply_on_transformed_logs = (known after apply)
      + id                        = (known after apply)
      + log_group_name            = (sensitive value)
      + name                      = "pinpoint-sms-rate-exceeded-us-west-2"
      + pattern                   = "{ $.delivery.providerResponse = \"Rate exceeded.\" }"
      + region                    = "us-west-2"
      + metric_transformation {
          + default_value = "0"
          + name          = "pinpoint-sms-rate-exceeded-us-west-2"
          + namespace     = "LogMetrics"
          + unit          = "None"
          + value         = "1"
        }
    }
  # aws_cloudwatch_metric_alarm.pinpoint-sms-blocked-as-spam-us-west-2-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "pinpoint-sms-blocked-as-spam-us-west-2-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-west-2:239043911459:alert-warning-us-west-2",
        ]
      + alarm_description                     = "More than 10 SMS have been blocked as spam over 12 hours"
      + alarm_name                            = "pinpoint-sms-blocked-as-spam-us-west-2-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "pinpoint-sms-blocked-as-spam-us-west-2"
      + namespace                             = "LogMetrics"
      + period                                = 43200
      + region                                = "us-west-2"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 10
      + treat_missing_data                    = "notBreaching"
    }
  # aws_cloudwatch_metric_alarm.pinpoint-sms-phone-carrier-unavailable-us-west-2-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "pinpoint-sms-phone-carrier-unavailable-us-west-2-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-west-2:239043911459:alert-warning-us-west-2",
        ]
      + alarm_description                     = "More than 100 SMS failed because a phone carrier is unavailable over 3 hours"
      + alarm_name                            = "pinpoint-sms-phone-carrier-unavailable-us-west-2-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "pinpoint-sms-phone-carrier-unavailable-us-west-2"
      + namespace                             = "LogMetrics"
      + period                                = 10800
      + region                                = "us-west-2"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 100
      + treat_missing_data                    = "notBreaching"
    }
  # aws_cloudwatch_metric_alarm.pinpoint-sms-rate-exceeded-us-west-2-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "pinpoint-sms-rate-exceeded-us-west-2-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-west-2:239043911459:alert-warning-us-west-2",
        ]
      + alarm_description                     = "At least 1 Pinpoint SMS rate exceeded error in 5 minutes"
      + alarm_name                            = "pinpoint-sms-rate-exceeded-us-west-2-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "pinpoint-sms-rate-exceeded-us-west-2"
      + namespace                             = "LogMetrics"
      + period                                = 300
      + region                                = "us-west-2"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }
  # aws_cloudwatch_metric_alarm.pinpoint-sms-success-rate-canadian-numbers-us-west-2-critical[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "pinpoint-sms-success-rate-canadian-numbers-us-west-2-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-west-2:239043911459:alert-critical-us-west-2",
        ]
      + alarm_description                     = "SMS success rate to Canadian numbers is below 50% over 4 consecutive periods of 6 hrs"
      + alarm_name                            = "pinpoint-sms-success-rate-canadian-numbers-us-west-2-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + datapoints_to_alarm                   = 4
      + dimensions                            = {
          + "Country" = "CA"
          + "SMSType" = "Transactional"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 4
      + id                                    = (known after apply)
      + metric_name                           = "SMSSuccessRate"
      + namespace                             = "AWS/SNS"
      + ok_actions                            = [
          + "arn:aws:sns:us-west-2:239043911459:alert-ok-us-west-2",
        ]
      + period                                = 21600
      + region                                = "us-west-2"
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 0.5
      + treat_missing_data                    = "notBreaching"
    }
  # aws_cloudwatch_metric_alarm.pinpoint-sms-success-rate-canadian-numbers-us-west-2-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "pinpoint-sms-success-rate-canadian-numbers-us-west-2-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-west-2:239043911459:alert-warning-us-west-2",
        ]
      + alarm_description                     = "SMS success rate to Canadian numbers is below 85% over 2 consecutive periods of 12 hours"
      + alarm_name                            = "pinpoint-sms-success-rate-canadian-numbers-us-west-2-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + datapoints_to_alarm                   = 2
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + region                                = "us-west-2"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
      + metric_query {
          + id          = "messagesPublished"
          + label       = "Messages Published"
          + return_data = false
            # (2 unchanged attributes hidden)
          + metric {
              + dimensions  = {
                  + "Country" = "CA"
                  + "SMSType" = "Transactional"
                }
              + metric_name = "NumberOfMessagesPublished"
              + namespace   = "AWS/SNS"
              + period      = 43200
              + stat        = "Sum"
                # (1 unchanged attribute hidden)
            }
        }
      + metric_query {
          + id          = "successRate"
          + label       = "Success Rate"
          + return_data = false
            # (2 unchanged attributes hidden)
          + metric {
              + dimensions  = {
                  + "Country" = "CA"
                  + "SMSType" = "Transactional"
                }
              + metric_name = "SMSSuccessRate"
              + namespace   = "AWS/SNS"
              + period      = 43200
              + stat        = "Average"
                # (1 unchanged attribute hidden)
            }
        }
      + metric_query {
          + expression  = "IF(successRate < 0.85 AND messagesPublished > 75, 0, 1)"
          + id          = "alarmCondition"
          + label       = "Guarded Alarm Condition"
          + return_data = true
            # (1 unchanged attribute hidden)
        }
    }
  # aws_cloudwatch_metric_alarm.pinpoint-spending-us-west-2-critical[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "pinpoint-spending-us-west-2-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-west-2:239043911459:alert-critical-us-west-2",
        ]
      + alarm_description                     = "Pinpoint spending reached 90% of limit this month"
      + alarm_name                            = "pinpoint-spending-us-west-2-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "SMSMonthToDateSpentUSD"
      + namespace                             = "AWS/SNS"
      + ok_actions                            = [
          + "arn:aws:sns:us-west-2:239043911459:alert-ok-us-west-2",
        ]
      + period                                = 300
      + region                                = "us-west-2"
      + statistic                             = "Maximum"
      + tags_all                              = (known after apply)
      + threshold                             = 27
      + treat_missing_data                    = "notBreaching"
    }
  # aws_cloudwatch_metric_alarm.pinpoint-spending-us-west-2-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "pinpoint-spending-us-west-2-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-west-2:239043911459:alert-warning-us-west-2",
        ]
      + alarm_description                     = "Pinpoint spending reached 80% of limit this month"
      + alarm_name                            = "pinpoint-spending-us-west-2-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "SMSMonthToDateSpentUSD"
      + namespace                             = "AWS/SNS"
      + period                                = 300
      + region                                = "us-west-2"
      + statistic                             = "Maximum"
      + tags_all                              = (known after apply)
      + threshold                             = 24
      + treat_missing_data                    = "notBreaching"
    }
  # aws_sqs_queue.eks_notification_canada_usdelivery_receipts will be created
  + resource "aws_sqs_queue" "eks_notification_canada_usdelivery_receipts" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = 0
      + max_message_size                  = 1048576
      + message_retention_seconds         = 345600
      + name                              = "eks-notification-canada-usdelivery-receipts"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + region                            = "us-west-2"
      + sqs_managed_sse_enabled           = true
      + tags                              = {
          + "Environment" = "staging"
        }
      + tags_all                          = {
          + "Environment" = "staging"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 310
    }
Plan: 12 to add, 0 to change, 0 to destroy.

# --- End of Plan 1 ---

```